<?php
	$id = "403262631";
	function check ($id){
		$checknum = $id%10;
		$id/=10;
		$total = 0;
		$i = 2;
		while ($id > 0){
			$total += ($id%10)*$i++;
			$id/=10;
		}
		if ($checknum == $total%10){
			return true;
		}else{
			return false;
		}
	}

	if( check($id) ){
		$ID = 
		[
			"section" => substr($id, 0, 1),
			"year" => substr($id, 1, 2),
			"dept" => substr($id, 3, 2),
			"class" => substr($id, 5, 1),
			"num" => substr($id, 6, 2),
			"checknum" => substr($id, 8, 1)
	 	];
	 	$data = 
		[
			"section" => "",
			"year" =>"",
			"dept" => "",
			"class" => "",
			"num" => $ID["num"],
			"checknum" => $ID["checknum"]
	 	];
	 	if ( $ID["section"] == "2" ){
	 		$data["section"] = "二年制";
	 	}else if ( $ID["section"] == "4" ){
	 		if ( $ID["class"] <= 2 ){
	 			$data["section"] = "日間部";
	 		}else{
	 			$data["section"] = "研究所";
	 		}
	 	}else if ( $ID["section"] == "5" ){
	 		$data["section"] = "進修部";
	 	}

		function get_year ($year){
			$year_list =
			[
				"05" => "一",
				"04" => "二",
				"03" => "三",
				"02" => "四"
			];
			$year_list2 =
			[
				"05" => "三",
				"04" => "四"
			];
			if ( $year == "2" ){
				return $year_list2[ $year ];
			}else{
				return $year_list[ $year ];
			}
		}

	 	function get_classes ($dept, $class){
			$class_list = 
			[
				"0" => "",
				"1" => "甲",
				"2" => "乙"
			];
			$class_list2 = 
			[
				"0" => "",
				"1" => "愛",
				"2" => "智"
			];
			if ($dept == "03"){
				return $class_list2[$class];
			}else{
				return $class_list[$class];
			}
			return false;
		}

		function get_dept ($dept, $class){
			$day_list = 
			[
				"01" => "中文",
				"02" => "歷史",
				"03" => "哲學",
				"04" => "圖書資訊",
				"05" => "影傳",
				"06" => "新傳",
				"07" => "廣告",
				"08" => "體育學組",
				"09" => "競技組",
				"10" => "運管組",
				"11" => "英文",
				"12" => "法文",
				"13" => "西文",
				"14" => "日文",
				"15" => "義文",
				"16" => "德語",
				"17" => "純數",
				"18" => "應數",
				"19" => "化學",
				"20" => "心理",
				"21" => "織品設計",
				"22" => "服飾行銷",
				"23" => "服飾組",
				"24" => "電機系晶",
				"25" => "電機電通",
				"26" => "資工",
				"27" => "生科",
				"28" => "物理",
				"29" => "光電",
				"30" => "餐旅",
				"31" => "兒家",
				"32" => "法律",
				"33" => "社會",
				"34" => "社工",
				"35" => "經濟",
				"36" => "財法",
				"37" => "學士後法律",
				"38" => "企管",
				"39" => "會計",
				"40" => "資管",
				"41" => "金融國企",
				"42" => "統資",
				"43" => "音樂",
				"44" => "應美",
				"45" => "景觀",
				"46" => "食科",
				"47" => "營養",
				"48" => "宗教",
				"49" => "護理",
				"50" => "公衛",
				"51" => "醫學",
				"52" => "臨心",
				"53" => "職治",
				"54" => "呼吸治療",
				"55" => "天主教研修",
				"56" => "領科學程",
				"57" => "醫資學程"
			];
			$night_list =
			[
				"01" => "中文",
				"02" => "歷史",
				"03" => "哲學",
				"04" => "大傳",
				"05" => "圖書資訊",
				"06" => "英文",
				"07" => "日文",
				"09" => "餐旅",
				"10" => "經濟",
				"11" => "法律",
				"12" => "應美",
				"13" => "宗教",
				"14" => "運管學程",
				"15" => "商管學程",
				"16" => "文創學程",
				"17" => "軟創學程"
				// "X" => "數學",
				// "X" => "企管",
				// "X" => "會計",
				// "X" => "金融國企",
				// "X" => "統資"
			];
			$two_year_list = 
			[
				"01" => "二護職"
			];
			$master_list =
			[
				"015" => "哲學碩職",
				"016" => "中文碩",
				"018" => "中文博",
				"025" => "體育碩職",
				"026" => "歷史碩",
				"028" => "哲學博",
				"035" => "大傳碩職",
				"036" => "哲學碩",
				"038" => "比博",
				"045" => "教發碩職",
				"046" => "體育碩",
				"048" => "化學博",
				"055" => "翻譯碩職",
				"056" => "大傳碩",
				"058" => "心理博",
				"065" => "織品碩職",
				"066" => "圖資碩",
				"068" => "應工博",
				"076" => "教發碩",
				"078" => "法律博",
				"085" => "資工碩職",
				"086" => "博物碩",
				"088" => "商學博",
				"095" => "餐管碩職",
				"096" => "英文碩",
				"105" => "兒家碩職",
				"106" => "法文碩",
				"108" => "音樂學系博士班演奏組",
				"115" => "法律碩職",
				"116" => "西文碩",
				"118" => "食營博",
				"125" => "企管碩職",
				"126" => "日文碩",
				"128" => "宗教碩",
				"135" => "會計碩職",
				"136" => "德文碩",
				"145" => "統資碩職",
				"146" => "語言碩",
				"155" => "資管碩職",
				"156" => "翻譯碩",
				"165" => "金融碩職",
				"166" => "物理碩",
				"175" => "科管碩職",
				"176" => "化學碩",
				"185" => "國創學程",
				"186" => "數學碩",
				"195" => "音樂碩職",
				"196" => "心理碩",
				"205" => "宗教碩職",
				"206" => "織品碩",
				"215" => "非營利碩職",
				"216" => "電機碩",
				"226" => "資工碩",
				"235" => "長照碩職",
				"236" => "生科碩",
				"245" => "社企學程碩職",
				"246" => "餐管碩",
				"256" => "兒家碩",
				"266" => "社會碩",
				"276" => "社工碩",
				"286" => "經濟碩",
				"296" => "法律碩",
				"306" => "財法碩",
				"316" => "企管碩",
				"326" => "會計碩",
				"336" => "統資碩",
				"346" => "資管碩",
				"356" => "金融國企碩",
				"366" => "音樂碩",
				"376" => "應美碩",
				"386" => "景觀碩",
				"396" => "食科碩",
				"406" => "營養碩",
				"416" => "國際經營碩",
				"426" => "宗教碩",
				"436" => "護理碩",
				"446" => "公衛碩",
				"456" => "臨心碩",
				"466" => "生物醫學碩",
				"476" => "社企學程",
				"486" => "品牌時尚碩"
				// "X" => "生技醫藥博士學位學程",
				// "X" => "生物醫學海量資料分析碩士學位學程",
				// "X" => "跨文化研究所比較文學與跨文化研究博士班",
				// "X" => "營養科學系碩士在職專班",
				// "X" => "電機工程學系碩士在職專班",
				// "X" => "音樂學系博士班音樂學組",
			];

			if ($data["section"] == "二年制"){
				return $two_year_list[$dept];
			}else if ($data["section"] = "日間部"){
				return $day_list[$dept];
			}else if ($data["section"] = "研究所"){
				return $master_list[$dept];
			}else if ($data["section"] = "進修部"){
				return $night_list[$dept.$class];
			}

		}
		$data["year"] = get_year ($ID["year"]);
		$data["dept"] = get_dept ($ID["dept"], $ID["class"]);
		$data["class"] = get_classes ($ID["dept"], $ID["class"]);
	 	print_r($data);
	}else{
		echo "check number error";
	}



	Page::Init(function(){

		Assets::Import("jquery");
		Assets::Import("materialize");
	});


	Assets::Script("/Resource/js/timetable.js");